Repository: netos23/the_shop
Catalog: mobile_app/the_store_app/lib/l10n/app_*.arb
Languages: ru

source: Login by phone
ru: Войти с помощью телефона

source: Login by e-mail
ru: Войти с помощью e-mail

source: Login by social network
ru: Войти с помощью социальных сетей

source: Forgot password?
ru: Забыли пароль?

source: Restore password
ru: Восстановление пароля

# logoutTitle
source: Do you realy want to log out?
ru: Вы действительно хотите выйти из аккаунта?

# logoutYes
source: Yes
ru: Да

# logoutNo
source: No
ru: Нет

source: Name is required
ru: Необходимо указать имя

source: technology
ru: технология

# byLoggingIn
source: By Logging In, I agree to the terms
ru: Регистрируясь, я соглашаюсь с условиями

source: Password
ru: Пароль

source: Error
ru: Ошибка

source: Ok
ru: ОК

source: Skip
ru: Пропустить

source: Your e-mail
ru: Ваш e-mail

source: user agreement
ru: политики конфиденциальности

# userAgreementTitle
source: User agreement
ru: Политика конфиденциальности

source: and
ru: и

# offerAgreement
source: offer contract
ru: договором оферты

source: Your phone
ru: Ваш телефон

source: Send code
ru: Получить код

# checkSms
source: Check sms-code
ru: Проверьте СМС-сообщения

# checkCart
source: ORDER VERIFICATION
ru: ПРОВЕРЯЕМ КОРЗИНУ

# weSentCodeViaSms
source: We have sent you a code via SMS. Enter it in the box below.
ru: Мы отправили вам код с помощью СМС. Введите его в поле ниже.

# checkEmail
source: Check your email
ru: Проверьте свой email

# weSentCodeViaEmail
source: We have sent you a code via email. Enter it in the box below.
ru: Мы отправили вам код с помощью email. Введите его в поле ниже.

# weSentCode
source: We have sent you a code via SMS. Enter it in the box below.
ru: Мы отправили вам код по SMS. Введите его в поле ниже.

source: Resend code
ru: Получить код повторно

# resendCodeWait
source: Wait
ru: Подождите

# resendCodeSec
source: sec
ru: сек.

source: Confirm
ru: Подтвердить

source: Personal data
ru: Личные данные

source: Man
ru: Мужчина

# wantGoToSiteNo
source: No
ru: Нет

# wantGoToSiteYes
source: Yes
ru: Да

source: Woman
ru: Женщина

source: cancel
ru: отменить

source: Your name
ru: Ваше имя

source: Your age
ru: Возраст

source: over 51
ru: старше 51

source: Go to scan
ru: Перейти к сканированию

# goToProducts
source: OPEN CATALOG
ru: ПЕРЕЙТИ К ТОВАРАМ

# emptyBasket
source: The basket is still empty :( Waiting for you to fill it!
ru: Корзина пока пустая :( Ждем, когда ты ее наполнишь!

# minimalPrice
source: Minimum order amount {moneyMin}
ru: Минимальная сумма заказа {moneyMin}

# expectedPrice
source: Add products for another {moneyMin}
ru: Добавьте товаров еще на {moneyMin}

# discount
source: Discount: {moneyMin}
ru: Скидка: {moneyMin}

source: Description
ru: Описание

source: Specifications
ru: Характеристики

# choseCityName
source: Enter the name of the city
ru: Введите название города

# emptyProductsSearch
source: We can't find what you're looking for :( Try changing the request.
ru: Мы не можем найти то, что ты ищешь :( Попробуй изменить запрос.

# emptySearch
source: No products were found for your request
ru: По Вашему запросу товаров не найдено

# historySearch
source: Search history
ru: История поиска

source: Clear
ru: Очистить

# oftenSearch
source: Often looking for
ru: Часто ищут

# toFavourites
source: ADD TO FAVORITES
ru: В ИЗБРАННОЕ

# inFavourites
source: FAVORITE
ru: В ИЗБРАННОМ

source: IN BASKET
ru: В КОРЗИНЕ

source: Total:
ru: Итого:

source: PROMO CODE
ru: ПРОМОКОД

# applyPromoCode
source: APPLY
ru: ПРИМЕНИТЬ

# weNeedThisData
source: We need this data in order to give you better sizing guidelines
ru: Эти данные нужны нам для того, чтобы давать вам более качественные рекомендации по выбору размера

source: Models
ru: 3D Модель

source: Basket
ru: Корзина

source: Profile
ru: Профиль

source: Catalog
ru: Каталог

source: Save
ru: Сохранить

source: You need to scan
ru: Для сканирования понадобятся

source: A room with uniform lighting
ru: Помещение с равномерным освещением

source: New, not crumpled A4 sheet
ru: Новый, не мятый лист А4

# newUpdateRespect
source: A new version of the STREET BEAT is available
ru: Вышло новое обновление приложения STREET BEAT

source: Smooth floor darker than A4 sheet
ru: Ровный пол темнее листа А4

source: Black socks or tights
ru: Чёрные носки или колготки

source: Before scan
ru: Перед сканированием

source: Wear black socks or tights
ru: Наденьте чёрные высокие носки или колготки

# openMap
source: Open the map
ru: Открыть карту

source: Open your shin to the knee
ru: Откройте голень до колена

# placeYourFoot
source: Place your foot in the center of A4 paper along the long side (the foot should not go over the edges of the sheet) and do not move it
ru: Поставьте ногу по центру листа A4 вдоль длинной стороны (стопа не должна выходить за края листа) и не шевелите ей

source: For accurate scanning
ru: Для точного сканирования

# freeUpSpace
source: Free up space around A4 sheet (remove foreign objects so that nothing bothers you)
ru: Освободите пространство вокруг листа А4 (уберите посторонние предметы, чтобы Вам ничего не мешало)

# doNotMoveYourFoot
source: Do not move your foot on A4 paper while scanning
ru: Во время сканирования не шевелите стопой, стоящей на листе А4

# downloadLastVersion
source: Download the latest version
ru: Скачайте последнюю версию

source: Download update
ru: Скачать обновление

# shiftYourBody
source: Shift your body weight onto the foot you are scanning
ru: Перенесите вес тела на сканируемую ногу

source: Scan
ru: Сканирование

# toScan
source: To scan, you need to photograph the foot from 5 angles, starting from 1
ru: Для сканирования необходимо сфотографировать стопу с 5 ракурсов, начиная с 1

source: Start scanning
ru: Начать сканирование

source: Start
ru: Начать

source: Next
ru: Далее

source: Foot selection
ru: Выбор ноги

# chooseTheFoot
source: Choose the foot with which it will be more convenient for you to start
ru: Выберите ногу, с которой вам будет удобнее начать

# scanLeftFoot
source: Scan the left foot
ru: Отсканируйте левую ногу

# scanRightFoot
source: Scan the right foot
ru: Отсканируйте правую ногу

# scanningWillStart
source: Scanning will start immediately after your choice
ru: Сканирование начнётся сразу после вашего выбора

# continueWithLeftFoot
source: Put the left foot on a paper, press the button and continue scanning
ru: Поставьте левую ногу на бумагу, нажмите кнопку и продолжайте сканирование.

# continueWithRightFoot
source: Put the right foot on a paper, press the button and continue scanning
ru: Поставьте правую ногу на бумагу, нажмите кнопку и продолжайте сканирование.

source: Click if you want to edit
ru: Нажмите, чтобы изменить

# findPerfectMath
source: Find your perfect match
ru: Найди свою идеальную пару

source: What is your name?
ru: Как вас зовут?

source: Models from
ru: Модель построена

# update
source: Update Scan
ru: Обновить сканирование

source: Linear foot length
ru: Линейная длина стопы

# linearWidthOfFoot
source: Linear width of the foot
ru: Линейная ширина стопы

source: Foot girth in bunches
ru: Обхват стопы в пучках

source: Lifting girth
ru: Обхват в подъёме

source: Left
ru: Левая

source: Right
ru: Правая

source: Parameters
ru: Параметры (мм)

source: Rescan
ru: Повторить сканирование

source: Model not built
ru: Модель не построена

# errorWithModels
source: An error occurred while building. Re-scan
ru: При построении возникла ошибка. Повторите сканирование

# processing
source: Processing the photo...
ru: Обрабатываем фото...

# makeModels
source: Your foot model is being built and will be ready in less than a minute
ru: Модель ваших ног строится и будет готова менее чем через минуту

# infoAbout
source: About developers
ru: О разработчиках

source: Offer contract
ru: Договор оферты

source: Settings
ru: Настройки

source: Delivery terms
ru: Условия доставки

# historyOrders
source: History of orders
ru: История заказов

source: About developers
ru: Информация о разработчиках

# noNetworkError
source: No network
ru: Нет сети

# unauthProfile
source: Register or login
ru: Для перехода в профиль войдите или зарегистрируйтесь

# unauthCatalog
source: Register or login
ru: Online примерка будет доступна после сканирования ног и регистрации

# wantScan
source: I want scan my legs!
ru: Хочу сделать сканирование!

# searchCaps
source: SEARCH
ru: ПОИСК

source: Search
ru: Поиск

# registerForBonus
source: Log in to use the bonus program
ru: Войдите, чтобы воспользоваться бонусной программой

source: Show full catalog
ru: Показать весь каталог

# showFullItems
source: Show all
ru: Показать всё

# filter
source: Filters
ru: Фильтры

source: Popular
ru: По популярности

# sort
source: Sorting
ru: Сортировка товаров

# possibleTypesDelivery
source: Delivery method
ru: Cпособ доставки

source: CHANGE CITY
ru: УКАЗАТЬ ДРУГОЙ ГОРОД

source: Delivery address
ru: Адрес доставки

source: Address
ru: Адрес

# feedbackCall
source: Request an operator call
ru: Нужен звонок оператора

# comment
source: Here you can leave comment (but this is optional)
ru: Здесь можно оставить комментарий (но это необязательно)

# payment
source: Payment method
ru: Способ оплаты

# orderAgreementPart0
source: By clicking the button, you agree to
ru: Нажимая кнопку, Вы соглашаетесь c

# orderAgreementPart1
source: the Company's Privacy Policy
ru: Политикой конфиденциальности Компании

# orderAgreementPart2
source: and
ru: и

# orderAgreementPart3
source: the Public Offer Agreement
ru: Договором публичной оферты

# street
source: Street, house, apartment
ru: Улица, дом, квартира

# orderProcessing
source: Processing the order...
ru: Обрабатываем заказ...

source: Products
ru: Товары

source: Delivery
ru: Доставка

# orderAvailableSoon
source: Your order will be processed soon
ru: Ваш заказ скоро поступит в обработку

# ordering
source: PLACE AN ORDER
ru: ОФОРМИТЬ ЗАКАЗ

# orderingScreen
source: Order checkout
ru: Оформление заказа

source: Phone
ru: Телефон

# required
source: This field must be filled in
ru: Это поле необходимо заполнить

source: Full name
ru: Полное имя

# forMen
source: Men
ru: Мужчинам

# forWomen
source: Women
ru: Женщинам

source: Tighter
ru: Плотнее

source: Freer
ru: Свободнее

# greatSize
source: Great
ru: Отлично

# neuralNetwork
source: Neural network determined: good fit in all zones of both legs
ru: Нейросеть определила: хорошее прилегание во всех зонах обеих ног

# favorite
source: To favorite
ru: В избранное

source: TO BASKET
ru: В корзину

source: Gender
ru: Пол

source: About scanning
ru: Информация о сканировании

source: Main Office
ru: Главный офис

# writeToTechSupport
source: Write to technical support
ru: Написать в техподдержку

# legalInfo
source: Legal information
ru: Юридическая финормация

source: Loyalty program
ru: Программа лояльности

# loyaltyProgramDescription
source: Specify discounts and delivery conditions when confirming the order with the operator
ru: Скидки и условия доставки уточняйте при подтверждении заказа у оператора

# addressInfo
source: Voronezh region, Voronezh city, Tekstilshchikov street, 5B, index 394026v
ru: Воронежская область, г. Воронеж, ул. Текстильщиков, 5Б, индекс 394026

# registerDescriptionShowCase
source: Register to try on shoes online
ru: Зарегистрируйся, чтобы примерить обувь онлайн.

source: required fields
ru: поля обязательные для заполнения

source: Confirmed
ru: Подтверждено

source: Agreement
ru: Соглашение

source: Incorrect phone
ru: Некорректный телефон

source: Incorrect email
ru: Некорректный email

source: Camera
ru: Камера

source: Gallery
ru: Галерея

source: Show Case
ru: Витрина

source: Favorites
ru: Избранное

# sendAppRating
source: Send Review
ru: Отправить отзыв

source: Please, rate our app
ru: Вам нравится наше приложение?

# goodRate
source: Good
ru: Хорошо

# badRate
source: Bad
ru: Плохо

source: Perfect
ru: Отлично

# perfectFootSize
source: In our service, we calculate the degree of fit of the shoe to the foot and, based on machine learning algorithms, we display the gradations of sensations of your particular foot in the selected shoe model.
ru: В нашем сервисе мы рассчитываем степень прилегания обуви к ноге и на основании алгоритмов машинного обучения выводим градации ощущений именно Вашей ноги в выбранной модели обуви.

# aboutService
source: Choosing the size, our service will tell you how suitable the option you have chosen and how the shoes will fit the foot.
ru: Выбирая размер, наш сервис подскажет насколько подходит выбранный Вами вариант и как обувь будет прилегать к ноге.

# aboutScanningAlgorithm
source: Our algorithm automatically detects two suitable sizes by enclosing them with a green border. The first will fit closer to your leg and the second will hold more loosely.
ru: Наш алгоритм автоматически определяет два подходящих размера обводя их зеленой рамкой. Первый будет плотнее прилегать к Вашей ноге а второй держаться свободнее.

# aboutScanningInfo
source: Thanks to our algorithm, you have a unique opportunity to appreciate the sensations Your feet in every shoe size, and make the final choice on your own according to how you prefer to wear shoes, denser or looser.
ru: Благодаря нашему алгоритму у Вас есть уникальная возможность оценить, ощущения Ваших ног в каждом размере обуви, и самостоятельно сделать окончательный выбор с учетом того, как Вы предпочитаете носить обувь, плотнее или свободнее.

# differentSizes
source: Each user has the parameters of each leg may differ, so the sensations in one and the same size may be different.
ru: У каждого пользователя параметры каждой ноги может отличаться, поэтому ощущения в одном и том же размере могут быть разными.

# availableInOneProductShop
source: Available in 1 shop
ru: Доступно в 1 мамркетплейсе

# availableProductShopsCount
source: Available in {count} shops
ru: Доступно в {count} маркетплейсах

source: All products
ru: Все товары

# infoDetail
source: Detail info
ru: Инфо о товаре

# inShop
source: Go to shop
ru: В магазин

# buyFavoriteMarket
source: Buy from your favorite marketplaces
ru: Покупайте в любимых маркетплейсах

# buyShoesAtRespect
source: Buy shoes at STREET BEAT
ru: Покупайте обувь в STREET BEAT

# prepositionWith
source: with
ru: с

# withService
source: service
ru: помощью сервиса

source: try on online
ru: примеряйте online

source: Scaning
ru: Сканирование

# doScan
source: Scan
ru: Сканировать

# scanAtRespect
source: Scan your feet at STREET BEAT stores
ru: Сканируй ноги в магазинах STREET BEAT

# scanAtRespectDescription
source: Come and we will find the perfect shoes!
ru: Приходите, и мы подберем идеальную обувь!

source: About go to scan
ru: Пройти сканирование

# turnOnSound
source: Turn on the sound, there are voice prompts in the app
ru: Включите звук, в приложении есть голосовые подсказки

source: Nothing to show
ru: Ничего не найдено

# couldNotFindAnything
source: Couldn't find anything for your request
ru: Ничего не смогли найти по вашему запросу

source: Disable filters
ru: Отключить фильтры

source: Reset
ru: Сбросить

source: All filters
ru: Все фильтры

source: Active filters
ru: Активные фильтры

source: Show products
ru: Показать товары

# versionAbout
source: Application version
ru: Версия приложения

# myInfo
source: My information
ru: Моя информация

# legModel3d
source: 3D leg model
ru: 3D модель ног

source: About us
ru: О нас

# empty
source: There's nothing here yet
ru: Здесь пока ничего нет

# addToFavorites
source: To add a product to favorites, click on the heart in the product card
ru: Чтобы добавить товар в избранное, нажмите на сердечко в карточке товара

# addFavorite
source: Product added to favorites
ru: Товар добавлен в избранное

# removeFavorite
source: The product was removed from favorites
ru: Товар удален из избранного

# errorFavorite
source: Couldn't change favorites
ru: Не удалось изменить избранное

source: Watched recently
ru: Вы недавно смотрели

# recommended
source: Recommended products
ru: Рекомендуемые товары

# exchange
source: Refund and Exchange
ru: Возрат и обмен

source: Notification History
ru: История уведомлений

source: Store map
ru: Карта магазинов

source: Scanner locations
ru: Места сканирования

# emptyProducts
source: We're sorry, but we couldn't find anything for your request
ru: Нам жаль, но мы ничего не смогли найти по вашему запросу

# lookSomethingElse
source: Look for something else
ru: Поискать что-то другое

# appVersion
source: Version:
ru: Версия:

source: App update
ru: Обновление приложения

# loginOrRegister
source: Login / Register
ru: Войти / Зарегистрироваться

source: Server version
ru: Версия сервера

# smsCodeInsert
source: Code insert automaticly.
ru: Код был вставлен автоматически.

# noNetwork
source: No network connection
ru: Нет подключения к сети

source: How to scan legs
ru: Как сканировать ноги

# howToScanLegsText1
source: Shift your body weight and bend the scanned leg at the knee
ru: Перенесите вес тела и согните сканируемую ногу в колене

# howToScanLegsText2
source: Combine the frames with a sheet of paper in a circle
ru: Совмещайте рамки с листом бумаги по кругу

source: Angle indicator
ru: Индикатор ракурса

# angleIndicatorText
source: Start scanning from the inside of the foot, as indicated by the flashing indicator.
ru: Начните сканирование с внутренней стороны стопы, как показывает мигающий индикатор.

source: All
ru: Все

source: Left foot
ru: Левая нога

source: Right foot
ru: Правая нога

source: flashing
ru: мигающий

# finalPrice
source: Total:
ru: Итого

source: Unable to add more products
ru: Невозможно добавить больше товаров

source: It has only
ru: В наличии только

source: Okay
ru: Понятно

source: Promotional code is applied:
ru: Применен промокод:

source: Bonuses
ru: Бонусы

source: Will receive
ru: Будет начисленно

source: Available for debiting
ru: Доступно для списания

source: Will be debited
ru: Будет списано

# cancelCaps
source: CANCEL
ru: ОТМЕНИТЬ

source: WRITE OFF BONUSES FOR PURCHASE
ru: СПИСАТЬ БОНУСЫ ЗА ПОКУПКУ

source: Is not available
ru: Нет в наличии

source: Order
ru: Заказ

source: For free
ru: Бесплатно

source: Order status:
ru: Статус заказа:

source: Payment status
ru: Статус оплаты

source: PAY FOR THE ORDER
ru: ОПЛАТИТЬ ЗАКАЗ

# repeatAnOrder
source: REPEAT THE ORDER
ru: ПОВТОРИТЬ ЗАКАЗ

source: My Orders
ru: Мои заказы

source: You haven’t bought anything yet
ru: Вы ещё ничего не купили

source: GO TO SHOPPING
ru: ПЕРЕЙТИ К ПОКУПКАМ

source: Recommended products
ru: Рекомендуемые товары

source: You don't have any new notifications
ru: У вас нет новых уведомлений

source: Go to the showcase
ru: Перейти на витрину

source: Do you really want to log out of your profile?
ru: Вы действительно хотите выйти из профиля?

source: EXIT
ru: ВЫЙТИ

source: Do you really want to delete your account?
ru: Вы действительно хотите удалить свой аккаунт?

source: DELETE
ru: УДАЛИТЬ

source: Delete your account
ru: Удалить свой аккаунт

source: Loyalty Program Status
ru: Статус программы лояльности

source: My balance
ru: Мой баланс

# bonusesOf
source: bonuses
ru: бонусов

source: Delivery and payment
ru: Доставка и оплата

source: Message SMS
ru: Отправить смс

source: Message Email
ru: Отправить сообщение

source: Get the code
ru: Получить код

source: Login
ru: Войти

source: Thank you
ru: Спасибо

source: Order details can be found in the profile
ru: Детали заказа находятся в профиле

source: To order
ru: К заказу

source: Payment not made, please pay the order
ru: Заказ не оплачен, пожалуйста оплатите заказ

source: no result
ru: Нет результат

source: Send your delivery time
ru: Укажите время доставки

source: settelment
ru: Населенный пункт

source: The delivery date
ru: Дата доставки

source: Select
ru: Выбрать

source: Post
ru: Почта

source: Select a address of that store
ru: Выберите адрес магазина

source: Select a facility
ru: Выберите объект

source: Select the address of the pickup point
ru: Выберите адрес пункта выдачи

source: My details
ru: Мои данные

source: Name and surname
ru: Имя и фамилия

source: Birthday
ru: день рождения

source: Select date
ru: Выберите дату

source: male
ru: муж

source: female
ru: жен

source: CALL A CONSULTANT
ru: ПОЗВОНИТЬ КОНСУЛЬТАНТУ

source: Online payment
ru: Онлайн оплата

source: Show
ru: Показать

source: product
ru: продукт

# product5
source: products
ru: продуктов

# product2
source: products
ru: продукта

# workInProgress
source: This page will be available in production
ru: Эта страница находится в разработке

# sendCodeTimer
source: Send the code again via
ru: Отправить код повторно через

# checkEnterCode
source: Check the entered code or try
ru: Проверьте введенный код или попробуйте

# enter
source: LOGIN
ru: ВОЙТИ

# rateApp
source: Please rate our app
ru: Пожалуйста, оцените наше приложение

# whatImprove
source: Tell us what to improve?
ru: Расскажите, что улучшить?

# yourComments
source: Your comment
ru: Ваш комментарий

# sendComment
source: SEND
ru: ОТПРАВИТЬ

# ascPrice
source: Ascending prices
ru: По возрастанию цены

# descPrice
source: Descending prices
ru: По убыванию цены

# none
source: Sort
ru: Сортировать

# descDiscount
source: Discount
ru: По размеру скидки

# authRequired
source: To use the profile, you need to log in or register.
ru: Чтобы воспользоваться профилем, Вам необходимо войти или зарегистрироваться.

source: Registration
ru: Регистрация

# userIsAlreadyExists
source: User with the same name already exists
ru: Пользователь с таким именем уже существует

# userIsNotRegistered
source: This account does not exist.
ru: Данный пользователь не был зарегистрирован

source: Blog
ru: Блог
